app/commands/todo_items/create.rb

INSERT INTO "todo_items" ("id", "description", "status", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["id", "a282f319-3b84-4fa3-9b66-85e9a53b1348"], ["description", ""], ["status", nil], ["title", nil], ["created_at", "2025-02-07 12:48:49.393614"], ["updated_at", "2025-02-07 12:48:49.393614"]]
---
    def call
      TodoItem.create!(@params.merge(id: SecureRandom.uuid))