app/commands/todo_items/destroy.rb

SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = $1 LIMIT $2  [["id", "c7f0b6d1-91b3-4f82-b8e1-ec66f95ca9b2"], ["LIMIT", 1]]
DELETE FROM "todo_items" WHERE "todo_items"."id" = $1  [["id", "c7f0b6d1-91b3-4f82-b8e1-ec66f95ca9b2"]]
---
    def call
      todo_item = TodoItem.find(@id)
      todo_item.destroy