app/commands/todo_items/index.rb

    def call
      result = TodoItem.all
---
SELECT "todo_items".* FROM "todo_items"