app/commands/todo_items/update.rb

SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "todo_items" SET "description" = $1, "title" = $2, "updated_at" = $3 WHERE "todo_items"."id" = $4  [["description", "Wow"], ["title", "Testing"], ["updated_at", "2025-02-09 02:59:51.900486"], ["id", "19e97d23-8595-4a9b-bdee-9d7cc350ea5d"]]
---
    def call
      todo_item = TodoItem.find(@params[:id])
      todo_item.update!(@params)